#ifndef STEP2_H
#define STEP2_H
#include <string>

/*
===========================================
[ ?섏쟾 ?덉텧 ?띿뒪??RPG ]
===========================================
?⑹궗???대쫫???낅젰?댁＜?몄슂: 泥좎닔

HP? MP瑜??낅젰?댁＜?몄슂: 80 60
怨듦꺽?κ낵 諛⑹뼱?μ쓣 ?낅젰?댁＜?몄슂: 40 25

====================================
泥좎닔 ???꾩옱 ?λ젰移?
====================================
HP: 80    MP: 60
怨듦꺽?? 40    諛⑹뼱?? 25
====================================
*/

namespace Step2 {
    enum class StatType {
        HP = 0,
        MP,
        Attack,
        Defense,
        Size
    };

    class Menu
    {
    public:
        Menu();
        void Run();
        void PrintStatus(std::wstring name, int stat[]);

    private:
        std::wstring name;
        int* stat;
    };
}

#endif // STEP2_H